# ElectricalSystemSet Constructor (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
ElectricalSystemSet Constructor
ElectricalSystemSet Class See Also
---
Initializes a new instance of the ElectricalSystemSet class
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
# Syntax
C#
---
```text
public ElectricalSystemSet()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ElectricalSystemSet()
```

# See Also
ElectricalSystemSet Class
Autodesk.Revit.DB.Electrical Namespace